<a href="https://colab.research.google.com/github/cocoisland/python_apps/blob/master/bees/bees_colony.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Save the bees.

### https://data.world/finley/bee-colony-statistical-data-from-1987-2017
### https://usda.library.cornell.edu/concern/publications/rn301137d?locale=en

###Glossary
https://github.com/cocoisland/python_apps/blob/master/bees/finley-bee-colony-statistical-data-from-1987-2017/glossary%20for%20bee%20stats.pdf

###Survey png
https://github.com/cocoisland/python_apps/blob/master/bees/finley-bee-colony-statistical-data-from-1987-2017/Search%20criteria%20for%20bee%20colony%20survey.png

###Census png
https://github.com/cocoisland/python_apps/blob/master/bees/finley-bee-colony-statistical-data-from-1987-2017/Search%20criteria%20for%20bee%20colony%20census.png

In [113]:
import pandas as pd

df_county = pd.read_csv('https://raw.githubusercontent.com/cocoisland/python_apps/master/bees/finley-bee-colony-statistical-data-from-1987-2017/Bee%20Colony%20Census%20Data%20by%20County.csv')
#df_loss = pd.read_excel('finley-bee-colony-statistical-data-from-1987-2017/Bee Colony Loss.xlsx', sheet_name='Sheet1') 
df_loss = pd.read_csv('https://raw.githubusercontent.com/cocoisland/python_apps/master/bees/Bee%20Colony%20Loss.csv')
df_state = pd.read_csv('https://raw.githubusercontent.com/cocoisland/python_apps/master/bees/finley-bee-colony-statistical-data-from-1987-2017/Bee%20Colony%20Survey%20Data%20by%20State.csv')

df_county.shape,  df_state.shape, df_loss.shape

((7830, 10), (3396, 9), (365, 8))

In [117]:
df_loss.head()

,Year,Season,State,Total Annual Loss,Beekeepers,Beekeepers Exclusive to State,Colonies,Colonies Exclusive to State
0,2016,Annual,MASSACHUSETTS,15.90%,87,94.30%,27186,2.30%
1,2016,Annual,MONTANA,17.10%,21,52.40%,35905,0.30%
2,2016,Annual,NEVADA,23.00%,13,92.30%,2512,5.20%
3,2016,Annual,MAINE,23.30%,65,93.80%,41102,1.40%
4,2016,Annual,WYOMING,23.40%,18,77.80%,6521,1.40%

In [0]:
# Convert camel case State to upper case to be the same as upper case State in df_state
df_loss['State']=df_loss['State'].str.upper()

In [0]:
# convert 2016/17 to 2016 to match Year in df_state
df_loss['Year']=df_loss.Year.str[:-3]

In [118]:
df_state.head()

,Year,Period,Week Ending,State,State ANSI,Watershed,Data Item,Value,CV (%)
0,2017,JAN THRU MAR,NaN,ALABAMA,1,NaN,ADDED & REPLACED,570,NaN
1,2017,JAN THRU MAR,NaN,ARIZONA,4,NaN,ADDED & REPLACED,"2,900",NaN
2,2017,JAN THRU MAR,NaN,ARKANSAS,5,NaN,ADDED & REPLACED,430,NaN
3,2017,JAN THRU MAR,NaN,CALIFORNIA,6,NaN,ADDED & REPLACED,"215,000",NaN
4,2017,JAN THRU MAR,NaN,COLORADO,8,NaN,ADDED & REPLACED,100,NaN

In [119]:
df_state.dtypes

Year             int64
Period          object
Week Ending    float64
State           object
State ANSI       int64
Watershed      float64
Data Item       object
Value           object
CV (%)         float64
dtype: object

In [0]:
# convert Value object to float
df_state['Value'] = df_state.Value.str.replace(',','').astype(float)

In [0]:
# convert df_state Year int64 to object type, so that to match df_loss Year type.
df_state['Year'] = df_state.Year.astype(object)

df_state value represents Agriculture value which might have relationship to bees colony.

Hence the intention to sum up total Agriculture value per State-Year and add into df_loss table.

In [122]:
# take ALABAMA as example to sum up value for year 2015
df_state.loc[(df_state['Year'] == 2015) & (df_state['State']=='ALABAMA')]

,Year,Period,Week Ending,State,State ANSI,Watershed,Data Item,Value,CV (%)
270,2015,JAN THRU MAR,NaN,ALABAMA,1,NaN,ADDED & REPLACED,2800.0,NaN
315,2015,APR THRU JUN,NaN,ALABAMA,1,NaN,ADDED & REPLACED,1900.0,NaN
360,2015,JUL THRU SEP,NaN,ALABAMA,1,NaN,ADDED & REPLACED,160.0,NaN
405,2015,OCT THRU DEC,NaN,ALABAMA,1,NaN,ADDED & REPLACED,80.0,NaN
720,2015,JAN THRU MAR,NaN,ALABAMA,1,NaN,"INVENTORY, MAX",7000.0,NaN
765,2015,APR THRU JUN,NaN,ALABAMA,1,NaN,"INVENTORY, MAX",7500.0,NaN
810,2015,JUL THRU SEP,NaN,ALABAMA,1,NaN,"INVENTORY, MAX",9000.0,NaN
855,2015,OCT THRU DEC,NaN,ALABAMA,1,NaN,"INVENTORY, MAX",8000.0,NaN
1438,2015,JAN THRU MAR,NaN,ALABAMA,1,NaN,"LOSS, DEADOUT",1800.0,NaN
1483,2015,APR THRU JUN,NaN,ALABAMA,1,NaN,"LOSS, DEADOUT",860.0,NaN
1528,2015,JUL THRU SEP,NaN,ALABAMA,1,NaN,"LOSS, DEADOUT",1400.0,NaN
1573,2015,OCT THRU DEC,NaN,ALABAMA,1,NaN,"LOSS, DEADOUT",610.0,NaN
1968,2015,MARKETING YEAR,NaN,ALABAMA,1,NaN,INVENTORY,7000.0,NaN
2008,2015,FIRST OF JAN,NaN,ALABAMA,1,NaN,INVENTORY,7000.0,NaN
2053,2015,FIRST OF APR,NaN,ALABAMA,1,NaN,INVENTORY,7500.0,NaN
2098,2015,FIRST OF JUL,NaN,ALABAMA,1,NaN,INVENTORY,8500.0,NaN
2143,2015,FIRST OF OCT,NaN,ALABAMA,1,NaN,INVENTORY,8000.0,NaN

In [123]:
# method 1 : summing up Value as subtotal. But we want total value for State-Year-Period
df_state.groupby(['State','Year','Period','Value']).sum().head(50)

                                     Week Ending  State ANSI  Watershed  \
State   Year Period         Value
ALABAMA 1987 MARKETING YEAR 46000.0          0.0           1        0.0
        1988 MARKETING YEAR 42000.0          0.0           1        0.0
        1989 MARKETING YEAR 41000.0          0.0           1        0.0
        1990 MARKETING YEAR 29000.0          0.0           1        0.0
        1991 MARKETING YEAR 23000.0          0.0           1        0.0
        1992 MARKETING YEAR 25000.0          0.0           1        0.0
        1993 MARKETING YEAR 19000.0          0.0           1        0.0
        1994 MARKETING YEAR 18000.0          0.0           1        0.0
        1995 MARKETING YEAR 16000.0          0.0           1        0.0
        1996 MARKETING YEAR 15000.0          0.0           1        0.0
        1997 MARKETING YEAR 14000.0          0.0           1        0.0
        1998 MARKETING YEAR 16000.0          0.0           1        0.0
        1999 MARKETING YEAR 17000.0          0.0           1        0.0
        2000 MARKETING YEAR 16000.0          0.0           1        0.0
        2001 MARKETING YEAR 14000.0          0.0           1        0.0
        2002 MARKETING YEAR 12000.0          0.0           1        0.0
        2003 MARKETING YEAR 13000.0          0.0           1        0.0
        2004 MARKETING YEAR 12000.0          0.0           1        0.0
        2005 MARKETING YEAR 13000.0          0.0           1        0.0
        2006 MARKETING YEAR 11000.0          0.0           1        0.0
        2007 MARKETING YEAR 11000.0          0.0           1        0.0
        2008 MARKETING YEAR 9000.0           0.0           1        0.0
        2009 MARKETING YEAR 9000.0           0.0           1        0.0
        2010 MARKETING YEAR 9000.0           0.0           1        0.0
        2011 MARKETING YEAR 9000.0           0.0           1        0.0
        2012 MARKETING YEAR 8000.0           0.0           1        0.0
        2013 MARKETING YEAR 7000.0           0.0           1        0.0
        2014 MARKETING YEAR 7000.0           0.0           1        0.0
        2015 APR THRU JUN   860.0            0.0           1        0.0
                            1900.0           0.0           1        0.0
                            7500.0           0.0           1        0.0
             FIRST OF APR   7500.0           0.0           1        0.0
             FIRST OF JAN   7000.0           0.0           1        0.0
             FIRST OF JUL   8500.0           0.0           1        0.0
             FIRST OF OCT   8000.0           0.0           1        0.0
             JAN THRU MAR   1800.0           0.0           1        0.0
                            2800.0           0.0           1        0.0
                            7000.0           0.0           1        0.0
             JUL THRU SEP   160.0            0.0           1        0.0
                            1400.0           0.0           1        0.0
                            9000.0           0.0           1        0.0
             MARKETING YEAR 7000.0           0.0           1        0.0
             OCT THRU DEC   80.0             0.0           1        0.0
                            610.0            0.0           1        0.0
                            8000.0           0.0           1        0.0
        2016 APR THRU JUN   130.0            0.0           1        0.0
                            930.0            0.0           1        0.0
                            1200.0           0.0           1        0.0
                            8000.0           0.0           1        0.0
             FIRST OF APR   8000.0           0.0           1        0.0

                                     CV (%)
State   Year Period         Value
ALABAMA 1987 MARKETING YEAR 46000.0     0.0
        1988 MARKETING YEAR 42000.0     0.0
        1989 MARKETING YEAR 41000.0     0.0
        1990 MARKETING YEAR 29000.0     0.0
        1991 MARKETING YEAR 23000.0     0.0
        1992 MARKETING YEAR 25000.0     0.0
        1993 MARKETING YEAR 19000.0     0.0
        1994 MARKETING YEAR 18000.0     0.0
        1995 MARKETING YEAR 16000.0     0.0
        1996 MARKETING YEAR 15000.0     0.0
        1997 MARKETING YEAR 14000.0     0.0
        1998 MARKETING YEAR 16000.0     0.0
        1999 MARKETING YEAR 17000.0     0.0
        2000 MARKETING YEAR 16000.0     0.0
        2001 MARKETING YEAR 14000.0     0.0
        2002 MARKETING YEAR 12000.0     0.0
        2003 MARKETING YEAR 13000.0     0.0
        2004 MARKETING YEAR 12000.0     0.0
        2005 MARKETING YEAR 13000.0     0.0
        2006 MARKETING YEAR 11000.0     0.0
        2007 MARKETING YEAR 11000.0     0.0
        2008 MARKETING YEAR 9000.0      0.0
        2009 MARKETING YEAR 9000.0      0.0
        2010 MARKETING YEAR 9000.0      0.0
        2011 MARKETING YEAR 9000.0      0.0
        2012 MARKETING YEAR 8000.0      0.0
        2013 MARKETING YEAR 7000.0      0.0
        2014 MARKETING YEAR 7000.0      0.0
        2015 APR THRU JUN   860.0       0.0
                            1900.0      0.0
                            7500.0      0.0
             FIRST OF APR   7500.0      0.0
             FIRST OF JAN   7000.0      0.0
             FIRST OF JUL   8500.0      0.0
             FIRST OF OCT   8000.0      0.0
             JAN THRU MAR   1800.0      0.0
                            2800.0      0.0
                            7000.0      0.0
             JUL THRU SEP   160.0       0.0
                            1400.0      0.0
                            9000.0      0.0
             MARKETING YEAR 7000.0      0.0
             OCT THRU DEC   80.0        0.0
                            610.0       0.0
                            8000.0      0.0
        2016 APR THRU JUN   130.0       0.0
                            930.0       0.0
                            1200.0      0.0
                            8000.0      0.0
             FIRST OF APR   8000.0      0.0

In [124]:
# method 2: summing value as total for State-Year-Period. But subtotal by Period
df_state.Value.groupby([df_state['State'],df_state['Year'],df_state['Period']]).sum().head(50)

State    Year  Period
ALABAMA  1987  MARKETING YEAR    46000.0
         1988  MARKETING YEAR    42000.0
         1989  MARKETING YEAR    41000.0
         1990  MARKETING YEAR    29000.0
         1991  MARKETING YEAR    23000.0
         1992  MARKETING YEAR    25000.0
         1993  MARKETING YEAR    19000.0
         1994  MARKETING YEAR    18000.0
         1995  MARKETING YEAR    16000.0
         1996  MARKETING YEAR    15000.0
         1997  MARKETING YEAR    14000.0
         1998  MARKETING YEAR    16000.0
         1999  MARKETING YEAR    17000.0
         2000  MARKETING YEAR    16000.0
         2001  MARKETING YEAR    14000.0
         2002  MARKETING YEAR    12000.0
         2003  MARKETING YEAR    13000.0
         2004  MARKETING YEAR    12000.0
         2005  MARKETING YEAR    13000.0
         2006  MARKETING YEAR    11000.0
         2007  MARKETING YEAR    11000.0
         2008  MARKETING YEAR     9000.0
         2009  MARKETING YEAR     9000.0
         2010  MARKETING YEAR     9000.0
         2011  MARKETING YEAR     9000.0
         2012  MARKETING YEAR     8000.0
         2013  MARKETING YEAR     7000.0
         2014  MARKETING YEAR     7000.0
         2015  APR THRU JUN      10260.0
               FIRST OF APR       7500.0
               FIRST OF JAN       7000.0
               FIRST OF JUL       8500.0
               FIRST OF OCT       8000.0
               JAN THRU MAR      11600.0
               JUL THRU SEP      10560.0
               MARKETING YEAR     7000.0
               OCT THRU DEC       8690.0
         2016  APR THRU JUN      10260.0
               FIRST OF APR       8000.0
               FIRST OF JAN       7500.0
               FIRST OF JUL       8000.0
               FIRST OF OCT       7000.0
               JAN THRU MAR      11780.0
               JUL THRU SEP      10040.0
               MARKETING YEAR     7000.0
               OCT THRU DEC       7760.0
         2017  APR THRU JUN       8160.0
               FIRST OF APR       6500.0
               FIRST OF JAN       7000.0
               JAN THRU MAR       9420.0
Name: Value, dtype: float64

In [0]:
# summing ALABAMA state and Year 2015 to check method3 total accuracy
10260+7500+7000+8500+8000+11600+10560+7000+8690

79110

In [0]:
# method 3: summing value as total for State-Year. Total by State-Year. 
dfs=df_state.Value.groupby([df_state['State'],df_state['Year']]).sum()

In [0]:
dfs=dfs.reset_index()

In [127]:
# Value per Alabama and 2015 = 79110.0 matched calculated above. Hence result checked out.
dfs.head(30)

      State  Year    Value
0   ALABAMA  1987  46000.0
1   ALABAMA  1988  42000.0
2   ALABAMA  1989  41000.0
3   ALABAMA  1990  29000.0
4   ALABAMA  1991  23000.0
5   ALABAMA  1992  25000.0
6   ALABAMA  1993  19000.0
7   ALABAMA  1994  18000.0
8   ALABAMA  1995  16000.0
9   ALABAMA  1996  15000.0
10  ALABAMA  1997  14000.0
11  ALABAMA  1998  16000.0
12  ALABAMA  1999  17000.0
13  ALABAMA  2000  16000.0
14  ALABAMA  2001  14000.0
15  ALABAMA  2002  12000.0
16  ALABAMA  2003  13000.0
17  ALABAMA  2004  12000.0
18  ALABAMA  2005  13000.0
19  ALABAMA  2006  11000.0
20  ALABAMA  2007  11000.0
21  ALABAMA  2008   9000.0
22  ALABAMA  2009   9000.0
23  ALABAMA  2010   9000.0
24  ALABAMA  2011   9000.0
25  ALABAMA  2012   8000.0
26  ALABAMA  2013   7000.0
27  ALABAMA  2014   7000.0
28  ALABAMA  2015  79110.0
29  ALABAMA  2016  77340.0

In [128]:
dfs.dtypes

State     object
Year       int64
Value    float64
dtype: object

In [0]:
# convert Year int64 to object type, in order to match df_loss Year object type.
dfs['Year']=dfs.Year.astype(object)

In [0]:
df_bees = df_loss[['State','Year']]

In [0]:
df_bees=pd.merge(df_bees, dfs, how='right',left_on=['State','Year'], right_on=['State','Year'])

In [132]:
df_bees.loc[df_bees['State']=='MONTANA']

       State  Year      Value
658  MONTANA  1987    95000.0
659  MONTANA  1988   105000.0
660  MONTANA  1989   100000.0
661  MONTANA  1990    98000.0
662  MONTANA  1991    86000.0
663  MONTANA  1992    87000.0
664  MONTANA  1993    95000.0
665  MONTANA  1994   119000.0
666  MONTANA  1995   106000.0
667  MONTANA  1996   117000.0
668  MONTANA  1997   107000.0
669  MONTANA  1998   115000.0
670  MONTANA  1999   122000.0
671  MONTANA  2000   124000.0
672  MONTANA  2001   136000.0
673  MONTANA  2002   134000.0
674  MONTANA  2003   145000.0
675  MONTANA  2004   140000.0
676  MONTANA  2005   130000.0
677  MONTANA  2006   132000.0
678  MONTANA  2007   135000.0
679  MONTANA  2008   134000.0
680  MONTANA  2009   146000.0
681  MONTANA  2010   157000.0
682  MONTANA  2011   145000.0
683  MONTANA  2012   145000.0
684  MONTANA  2013   159000.0
685  MONTANA  2014   162000.0
686  MONTANA  2015  1018000.0
687  MONTANA  2016  1108420.0
688  MONTANA  2017   414870.0

In [0]:
df_bees['Colonies'] = df_loss['Colonies']

In [134]:
df_bees.head()

     State  Year    Value  Colonies
0  ALABAMA  1987  46000.0   27186.0
1  ALABAMA  1988  42000.0   35905.0
2  ALABAMA  1989  41000.0    2512.0
3  ALABAMA  1990  29000.0   41102.0
4  ALABAMA  1991  23000.0    6521.0